**DataFrame**:

1. "DataFrame" is a Data structure used in python.

2. It is just like a table, containing multiple rows and columns.

3. Every row of a DataFrame holds and index automatically and the index starts from 0.

4. Many Data Type like List, Dictionary, Series (Data Structure) and Numpy Array can be converted into a DataFrame using Pandas.

5. DataFrames are indexable both by column and row. Also one can subset a DataFrame based on conditions.

**Lets start working with DataFrame:-**

**Creation Of DataFrame:**

In [1]:
import pandas as pd #importing library
data = [4,9,14,18,22]
df = pd.DataFrame(data) #creating dataframe

In [2]:
df #no columns are assigned

    0
0   4
1   9
2  14
3  18
4  22

**By default every element has an index 0,1,2 and so on....**

In [3]:
data = [['Zeeshan',40], ['Shahbaz', 25], ['Krishna',30], ['Pooja',35]] #n-dimensional array
df = pd.DataFrame(data,columns=['Name','Salary in Month']) #converting to dataframe

In [4]:
df #with column name

      Name  Salary in Month
0  Zeeshan               40
1  Shahbaz               25
2  Krishna               30
3    Pooja               35

In [5]:
import numpy as np
ar = np.array([[4,5,7,3],[5,5,6,8],[6,5,9,7]]) #numpy multidimensional array
df=pd.DataFrame(ar) #converting an array to a dataframe

In [6]:
df

   0  1  2  3
0  4  5  7  3
1  5  5  6  8
2  6  5  9  7

In [7]:
dictionary_1 = {'Weight':[56,63,82,45], 'Hight in Ft':[5,6,4,5], 'Clour':['Black','Blue','Green','Yellow'] } #creating dictionary
df = pd.DataFrame(dictionary_1) #converting the dictionary to dataframe

In [8]:
df

   Weight  Hight in Ft   Clour
0      56            5   Black
1      63            6    Blue
2      82            4   Green
3      45            5  Yellow

**Setting index Manually**:

In [9]:
df = pd.DataFrame(dictionary_1, index=['Zeeshan','Krishna','Shahbaz','Pooja']) #with manual index

In [10]:
df

         Weight  Hight in Ft   Clour
Zeeshan      56            5   Black
Krishna      63            6    Blue
Shahbaz      82            4   Green
Pooja        45            5  Yellow

**Setting index and column names simultaneously:**

In [11]:
df

         Weight  Hight in Ft   Clour
Zeeshan      56            5   Black
Krishna      63            6    Blue
Shahbaz      82            4   Green
Pooja        45            5  Yellow

In [12]:
df = pd.DataFrame(ar, index=['Math','English','History'], columns=['Zeeshan','Krishna','Shahbaz','Pooja']) #setting index column manually

In [13]:
df

         Zeeshan  Krishna  Shahbaz  Pooja
Math           4        5        7      3
English        5        5        6      8
History        6        5        9      7

In [14]:
df2 = df[['Zeeshan','Krishna','Pooja']].copy() #creating new dataframe from an old one

In [15]:
df2

         Zeeshan  Krishna  Pooja
Math           4        5      3
English        5        5      8
History        6        5      7

**Indexing Columns and Rows from DataFrame**

In [16]:
df['Shahbaz'] #indexing by column/taking only a column from the dataframe

Math       7
English    6
History    9
Name: Shahbaz, dtype: int32

In [17]:
df[['Krishna','Pooja']] #taking multiple columns from the dataframe

         Krishna  Pooja
Math           5      3
English        5      8
History        5      7

In [18]:
c = pd.DataFrame([4,5,6], columns=['Ibtesam']) #creating a new dataframe with a column I want to add
df['Ibtesam'] = c['Ibtesam'] #adding the new column to the existing dataframe

In [19]:
df

         Zeeshan  Krishna  Shahbaz  Pooja  Ibtesam
Math           4        5        7      3      NaN
English        5        5        6      8      NaN
History        6        5        9      7      NaN

In [22]:
c = pd.DataFrame([6,8,7], index=['Math','English','History'], columns=['Ibtesam'])

In [23]:
c

         Ibtesam
Math           6
English        8
History        7

In [24]:
df['Ibtesam'] = c['Ibtesam']

In [25]:
df

         Zeeshan  Krishna  Shahbaz  Pooja  Ibtesam
Math           4        5        7      3        6
English        5        5        6      8        8
History        6        5        9      7        7

**Thank You**